# Where apps get installed
cask_args appdir: '/Applications'

# Taps we need to make this all work
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"

# Install Packages
brew "apple-gcc42"
brew "autoconf"
brew "boost"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "pcre"
brew "glib"
brew "pixman"
brew "cairo"
brew "coreutils"
brew "zeromq"
brew "czmq"
brew "dnsmasq"
brew "jpeg"
brew "libtiff"
brew "elixir"
brew "git"
brew "pkg-config"
brew "gobject-introspection"
brew "icu4c"
brew "harfbuzz"
brew "libtool"
brew "pango"
brew "fontforge"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "xz"
brew "grc"
brew "node"
brew "heroku"
brew "imagemagick"
brew "jp2a"
brew "jpegoptim"
brew "libsodium"
brew "libyaml"
brew "mas"
brew "mysql"
brew "mysql@5.6"
brew "nginx"
brew "node-build"
brew "phantomjs"
brew "pngcrush"
brew "pngpaste"
brew "postgresql"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "spaceman-diff"
brew "spark"
brew "trash"
brew "unrar"
brew "v8"
brew "v8@3.15"
brew "wget"
brew "youtube-dl"
brew "z"

# Install Apps
cask "1password"
cask "alfred"
cask "atom"
cask "bartender"
cask "caffeine"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "hazel"
cask "hyper"
cask "keyboard-maestro"
cask "moom"
cask "qlmarkdown"
cask "skype"
cask "textexpander"
cask "vlc"

# Install Mac App Store Apps
mas "Bear", id: 1091189122
mas "BreakTime", id: 427475982
mas "Byword", id: 420212497
mas "Characters", id: 536511979
mas "Day One", id: 1055511498
mas "Display Menu", id: 549083868
mas "Fantastical 2", id: 975937182
mas "Frank DeLoupe", id: 530458789
mas "GarageBand", id: 682658836
mas "Gifox", id: 1082624744
mas "iA Writer", id: 775737590
mas "Icon Slate", id: 439697913
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kuvva", id: 451557061
mas "Logic Pro X", id: 634148309
mas "Memory Clean 2", id: 1114591412
mas "Newton", id: 1059655371
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Redacted", id: 984968384
mas "Shush", id: 496437906
mas "Todoist", id: 585829637
mas "Tweetbot", id: 557168941
mas "Ulysses", id: 623795237
mas "VOX", id: 461369673
mas "Wunderlist", id: 410628904
