tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "shopify/shopify"
brew "libtiff"
brew "openssl@1.1"
brew "autoconf"
brew "bison"
brew "icu4c"
brew "xz"
brew "boost"
brew "bzip2"
brew "composer"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre"
brew "glib"
brew "pkg-config"
brew "pixman"
brew "python@3.9"
brew "cairo"
brew "circleci"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "libssh2"
brew "openldap"
brew "curl"
brew "libsodium"
brew "zeromq"
brew "czmq"
brew "erlang"
brew "jpeg"
brew "elixir"
brew "libtool"
brew "guile"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "srt"
brew "ffmpeg"
brew "pango"
brew "python@3.10"
brew "fnm"
brew "fontforge"
brew "freetds"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "git"
brew "gnupg"
brew "gobject-introspection"
brew "grc"
brew "httpd"
brew "shared-mime-info"
brew "libheif"
brew "python@3.8"
brew "imagemagick", link: false
brew "imagemagick@6"
brew "jp2a"
brew "jpegoptim"
brew "krb5"
brew "libfido2"
brew "libiconv"
brew "libpq"
brew "libyaml"
brew "libzip"
brew "mas"
brew "mcrypt"
brew "zlib"
brew "mysql", link: false
brew "mysql@5.6"
brew "nghttp2"
brew "nginx", restart_service: true
brew "nss"
brew "openssl@3"
brew "php@7.4", restart_service: true
brew "pinentry-mac"
brew "pngcrush"
brew "pngpaste"
brew "postgresql"
brew "re2c"
brew "redis", restart_service: true
brew "spaceman-diff"
brew "spark"
brew "trash"
brew "v8"
brew "v8@3.15"
brew "wget"
brew "youtube-dl"
brew "z"
brew "shopify/shopify/shopify-cli"
cask "1password"
cask "alfred"
cask "atom"
cask "bartender"
cask "caffeine"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "hazel"
cask "imageoptim"
cask "insomnia"
cask "kap"
cask "keyboard-maestro"
cask "moom"
cask "notion"
cask "qlmarkdown"
cask "skype"
cask "textexpander"
mas "1Password for Safari", id: 1569813296
mas "Characters", id: 536511979
mas "Contrast", id: 1254981365
mas "Day One", id: 1055511498
mas "Display Menu", id: 549083868
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "Icon Slate", id: 439697913
mas "iMovie", id: 408981434
mas "Matter", id: 1548677272
mas "Messenger", id: 1480068668
mas "Notion Web Clipper", id: 1559269364
mas "Save to Raindrop.io", id: 1549370672
mas "Spark", id: 1176895641
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "Xcode", id: 497799835
